app/controllers/words_controller.rb

  def index
    render json: Word.all
---
SELECT "words".* FROM "words"

  def find_or_import_word
    @word = Word.find_or_initialize_by(name: params[:name])
---
SELECT  "words".* FROM "words" WHERE "words"."name" = ? LIMIT 1  [["name", "World"]]